In [1]:
import pandas as pd

In [2]:
data = {
    "id": [1, 2, 3, 4, 5],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [25, 30, 35, 40, 28],
    "city": ["Delhi", "Mumbai", "Delhi", "Bangalore", "Mumbai"],
    "salary": [50000, 60000, 70000, 80000, 65000]
}

df = pd.DataFrame(data)

In [3]:
df

   id     name  age       city  salary
0   1    Alice   25      Delhi   50000
1   2      Bob   30     Mumbai   60000
2   3  Charlie   35      Delhi   70000
3   4    David   40  Bangalore   80000
4   5      Eva   28     Mumbai   65000

In [23]:
df[['name', 'salary']]

      name  salary
0    Alice   50000
1      Bob   70000
2  Charlie   70000
3    David   70000
4      Eva   65000

In [5]:
df.loc[df["age"]>30]

   id     name  age       city  salary
2   3  Charlie   35      Delhi   70000
3   4    David   40  Bangalore   80000

In [6]:
df['salary_after_hike'] = df['salary'] * 1.10
df

   id     name  age       city  salary  salary_after_hike
0   1    Alice   25      Delhi   50000            55000.0
1   2      Bob   30     Mumbai   60000            66000.0
2   3  Charlie   35      Delhi   70000            77000.0
3   4    David   40  Bangalore   80000            88000.0
4   5      Eva   28     Mumbai   65000            71500.0

In [7]:
df.sort_values('salary', ascending=False)

   id     name  age       city  salary  salary_after_hike
3   4    David   40  Bangalore   80000            88000.0
2   3  Charlie   35      Delhi   70000            77000.0
4   5      Eva   28     Mumbai   65000            71500.0
1   2      Bob   30     Mumbai   60000            66000.0
0   1    Alice   25      Delhi   50000            55000.0

In [8]:
df['salary'].mean()

np.float64(65000.0)

In [9]:
df['city'].value_counts()

city
Delhi        2
Mumbai       2
Bangalore    1
Name: count, dtype: int64

In [10]:
df.groupby('city')['salary'].mean()

city
Bangalore    80000.0
Delhi        60000.0
Mumbai       62500.0
Name: salary, dtype: float64

In [11]:
df['age_group'] = df['age'].apply(
    lambda x: "Young" if x < 30 else "Senior"
)
df

   id     name  age       city  salary  salary_after_hike age_group
0   1    Alice   25      Delhi   50000            55000.0     Young
1   2      Bob   30     Mumbai   60000            66000.0    Senior
2   3  Charlie   35      Delhi   70000            77000.0    Senior
3   4    David   40  Bangalore   80000            88000.0    Senior
4   5      Eva   28     Mumbai   65000            71500.0     Young

In [12]:
df.drop_duplicates()

   id     name  age       city  salary  salary_after_hike age_group
0   1    Alice   25      Delhi   50000            55000.0     Young
1   2      Bob   30     Mumbai   60000            66000.0    Senior
2   3  Charlie   35      Delhi   70000            77000.0    Senior
3   4    David   40  Bangalore   80000            88000.0    Senior
4   5      Eva   28     Mumbai   65000            71500.0     Young

In [13]:
df.rename(columns={'monthly_salary': 'salary'}, inplace=True)
df

   id     name  age       city  salary  salary_after_hike age_group
0   1    Alice   25      Delhi   50000            55000.0     Young
1   2      Bob   30     Mumbai   60000            66000.0    Senior
2   3  Charlie   35      Delhi   70000            77000.0    Senior
3   4    David   40  Bangalore   80000            88000.0    Senior
4   5      Eva   28     Mumbai   65000            71500.0     Young

In [14]:
df.loc[:, ['name', 'salary']]

      name  salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3    David   80000
4      Eva   65000

In [15]:
df.loc[df['city'] == 'Mumbai', ['name', 'salary']]

  name  salary
1  Bob   60000
4  Eva   65000

In [16]:
df.loc[df['age'] >= 30, 'salary'] = 70000
df

   id     name  age       city  salary  salary_after_hike age_group
0   1    Alice   25      Delhi   50000            55000.0     Young
1   2      Bob   30     Mumbai   70000            66000.0    Senior
2   3  Charlie   35      Delhi   70000            77000.0    Senior
3   4    David   40  Bangalore   70000            88000.0    Senior
4   5      Eva   28     Mumbai   65000            71500.0     Young

In [17]:
df.loc[df['salary'].idxmax()]

id                         2
name                     Bob
age                       30
city                  Mumbai
salary                 70000
salary_after_hike    66000.0
age_group             Senior
Name: 1, dtype: object

In [18]:
df.loc[(df['city'] == 'Mumbai') & (df['salary'] > 60000)]

   id name  age    city  salary  salary_after_hike age_group
1   2  Bob   30  Mumbai   70000            66000.0    Senior
4   5  Eva   28  Mumbai   65000            71500.0     Young

In [19]:
df.to_csv('employees.csv', index=False)

In [20]:
df.to_dict(orient='records')

[{'id': 1,
  'name': 'Alice',
  'age': 25,
  'city': 'Delhi',
  'salary': 50000,
  'salary_after_hike': 55000.00000000001,
  'age_group': 'Young'},
 {'id': 2,
  'name': 'Bob',
  'age': 30,
  'city': 'Mumbai',
  'salary': 70000,
  'salary_after_hike': 66000.0,
  'age_group': 'Senior'},
 {'id': 3,
  'name': 'Charlie',
  'age': 35,
  'city': 'Delhi',
  'salary': 70000,
  'salary_after_hike': 77000.0,
  'age_group': 'Senior'},
 {'id': 4,
  'name': 'David',
  'age': 40,
  'city': 'Bangalore',
  'salary': 70000,
  'salary_after_hike': 88000.0,
  'age_group': 'Senior'},
 {'id': 5,
  'name': 'Eva',
  'age': 28,
  'city': 'Mumbai',
  'salary': 65000,
  'salary_after_hike': 71500.0,
  'age_group': 'Young'}]